# Data Transformation Using melt(), pivot(), and pivot\_table() in Pandas

## melt() ‚Äî Converting Wide Format to Long Format

The melt() function reshapes a DataFrame from wide format to long format. It is especially useful for normalizing and tidying data by turning columns into rows.

üîπ‚ÄØUse When:

* You have one observation per row and each column is a separate variable.
* You need to tidy data for visualization or analysis.

üîπ‚ÄØKey Parameters:

* id\_vars: Columns to keep as identifiers (e.g., names, dates).
* value\_vars: Columns to unpivot into rows.
* var\_name: Name for the new column holding variable names.
* value\_name: Name for the new column holding values.

üîπ‚ÄØWhy Use melt()?

* Makes data easier to visualize and analyze.
* Converts wide data into tidy, long-form structure.
* Simplifies grouping, filtering, and aggregation.

---

## pivot() ‚Äî Converting Long Format to Wide Format

The pivot() function does the reverse of melt(): it reshapes long-form data into wide form, spreading values across new columns.

üîπ‚ÄØUse When:

* You want to restructure a tidy DataFrame so that unique values from a column become new columns.
* Each combination of index and column must be unique.

üîπ‚ÄØKey Parameters:

* index: Column(s) to use as the new row index.
* columns: Column whose values will become new column headers.
* values: Column whose values fill the new table.

üîπ‚ÄØWhy Use pivot()?

* Organizes data into a clear tabular format.
* Suitable for summarizing and reporting data.
* Great for reversing the effect of melt().

üî∏‚ÄØNote: pivot() requires unique combinations of index and columns. If duplicates exist, it will raise an error.

---

## pivot\_table() ‚Äî Pivoting with Aggregation Support

The pivot\_table() function extends pivot() by handling duplicate entries using aggregation.

üîπ‚ÄØUse When:

* You have duplicate index-column combinations that need to be summarized.
* You want to apply a function like mean, sum, or count to group data.

üîπ‚ÄØKey Parameters:

* index, columns, values (same as pivot)
* aggfunc: Aggregation function (e.g., mean, sum, count) to resolve duplicates.

üîπ‚ÄØWhy Use pivot\_table()?

* Manages duplicates gracefully through aggregation.
* Ideal for data summarization and analysis.
* Provides flexible, Excel-style pivot table functionality.

---

## Summary

| Function       | Direction   | Use Case                                 | Handles Duplicates |
| -------------- | ----------- | ---------------------------------------- | ------------------ |
| melt()         | Wide ‚Üí Long | Normalize or tidy data for analysis      | ‚úÖ Not applicable   |
| pivot()        | Long ‚Üí Wide | Reformat for readability or reporting    | ‚ùå No               |
| pivot\_table() | Long ‚Üí Wide | Aggregate and summarize with flexibility | ‚úÖ Yes              |

In [1]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [16]:
df_melted = df.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score")
df_melted

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [17]:
df_melted.pivot(index="Name", columns="Subject", values="Score")

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

In [18]:
df_melted.pivot_table(index="Name", columns="Subject", values="Score", aggfunc="mean")

Subject  English  Math  Science
Name
Alice       88.0  85.0     90.0
Bob         85.0  78.0     82.0
Charlie     94.0  92.0     89.0

In [11]:
print(df.columns.tolist())

['Name', 'Math', 'Science', 'English']

In [12]:
print(df.columns)

Index(['Name', 'Math', 'Science', 'English'], dtype='object')

In [13]:
pivot_df = df_long.pivot(index="Name", columns="Subject", values="Score")
print(pivot_df)

NameError: name 'df_long' is not defined